УРВ_файловая/src/InformationRegisters/ПодпискиНаУведомления/ПодпискиНаУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодпискиНаУведомления</name>
  <resources>
    <name>ПодпискаАктивна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>CatalogRef.ВидыБизнесСобытий</types>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПодписки</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.Обращение</types>
      <types>CatalogRef.Ошибки</types>
      <types>BusinessProcessRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/Enums/ПотребителиБизнесСобытий/ПотребителиБизнесСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПотребителиБизнесСобытий</name>
  <enumValues>
    <name>АвтоматическийЗапускБизнесПроцессов</name>
  </enumValues>
  <enumValues>
    <name>РассылкаУведомлений</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/Enums/НастройкиУведомлений/НастройкиУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НастройкиУведомлений</name>
  <enumValues>
    <name>СрокУведомления</name>
  </enumValues>
  <enumValues>
    <name>ЧастотаУведомления</name>
  </enumValues>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
</mdclass:Enum>

УРВ_файловая/src/InformationRegisters/ПодпискиНаУведомления/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 1 Тогда
		
		ЭлементЗаписи = Получить(0);
		ВидСобытия = ЭлементЗаписи.ВидСобытия;
		ПодпискаАктивна = ЭлементЗаписи.ПодпискаАктивна;
		Если ТипЗнч(ВидСобытия) <> Тип("СправочникСсылка.ВидыБизнесСобытий")
			ИЛИ ТипЗнч(ПодпискаАктивна) <> Тип("Булево")
			ИЛИ ПодпискаАктивна <> Истина Тогда
			Возврат;
		КонецЕсли;
		
		БизнесСобытия.СохранитьПодпискуНаБизнесСобытия(ВидСобытия, 
			Перечисления.ПотребителиБизнесСобытий.РассылкаУведомлений);
		
	ИначеЕсли Количество() = 0 Тогда // удаление
		
		Если ТипЗнч(ЭтотОбъект.Отбор.ВидСобытия.Значение) <> Тип("СправочникСсылка.ВидыБизнесСобытий") Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоПодписчиков = ПолучитьКоличествоПодписчиков(ЭтотОбъект.Отбор.ВидСобытия.Значение);
		
		Если КоличествоПодписчиков = 0 Тогда
			БизнесСобытия.УдалитьПодпискуНаБизнесСобытия(ЭтотОбъект.Отбор.ВидСобытия.Значение, 
				Перечисления.ПотребителиБизнесСобытий.РассылкаУведомлений);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКоличествоПодписчиков(ВидСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПодпискиНаУведомления.ВидСобытия КАК ВидСобытия
		|ИЗ
		|	РегистрСведений.ПодпискиНаУведомления КАК ПодпискиНаУведомления
		|ГДЕ
		|	ПодпискиНаУведомления.ВидСобытия = &ВидСобытия
		|	И ПодпискиНаУведомления.ПодпискаАктивна = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НастройкиУведомленийПоУмолчанию.ВидСобытия
		|ИЗ
		|	РегистрСведений.НастройкиУведомленийПоУмолчанию КАК НастройкиУведомленийПоУмолчанию
		|ГДЕ
		|	НастройкиУведомленийПоУмолчанию.Настройка = ЗНАЧЕНИЕ(Перечисление.НастройкиУведомлений.Подписка)
		|	И НастройкиУведомленийПоУмолчанию.ВидСобытия = &ВидСобытия
		|	И НастройкиУведомленийПоУмолчанию.Значение = ИСТИНА";
	
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Возврат Таблица.Количество();
	
КонецФункции

#КонецОбласти

#КонецЕсли
